---
kind: other
id: Properties.T:Autodesk.Revit.DB.Macros.ApplicationEntryPoint
source: html/11b68f71-7191-61f6-fcd4-8236979986a6.htm
---
# ApplicationEntryPoint Properties

Retrieves the Id of the currently running external application.